# TemplateName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TemplateName Property
ParameterTypeId Class See Also
---
"Template"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TemplateName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TemplateName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TemplateName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace